[
  {
    "id": "ad_1_storyselling",
    "title": "Bài 1 - Dạng Storyselling",
    "type": "Storyselling",
    "content": "5 năm về trước, tôi bắt đầu kinh doanh trên Internet...\nĐó là một sản phẩm đơn giản.\nNó có tên La Jolie.\nNhư bao người trẻ mới khởi nghiệp, tôi đầu tư đủ thứ xịn nhất, từ bài PR trên báo, từ thiết kế đẹp, thuê quay chụp đắt tiền,...\nĐầu tư nhiều như thế, tôi nghĩ sản phẩm của tôi đã được trải thảm những thứ tốt nhất.\nTôi nghĩ mọi người sẽ tranh nhau mua nó, yêu thích nó, thậm chí giới thiệu nó cho bạn bè...\nTôi nghĩ tôi sắp giàu, tôi sắp thành đạt!!\nRồi mọi người sẽ thi nhau nói về tôi, đến nỗi người yêu cũ cũng sẽ quay lại với tôi, năn nỉ cầu xin tôi sự thương sót…\nTôi tỉ mỉ từng chi tiết, thuê người review.\nBook hẳn Agency để chạy quảng cáo.\nMọi thứ đều hoàn hảo.\nNgoại trừ…\nKHÔNG AI MUA SẢN PHẨM CỦA TÔI!!\n=> Nhưng mọi vấn đề vẫn chưa dừng lại, những gì diễn ra sau đó mới khiến chúng ta phải kinh ngạc...\nBạn hãy xem toàn bộ quá trình của tôi ở đây:\nhttps://borntowrite.vn/my-story/\nCứ thử, rồi bạn sẽ thấy..."
  },
  {
    "id": "ad_2_secret",
    "title": "Bài 2 - Dạng Secret",
    "type": "Secret",
    "image": "https://placehold.co/600x400/808080/FFFFFF?text=Image+1",
    "content": "Tôi sắp sửa chia sẻ với bạn một bí mật - Nhưng bạn phải hứa với tôi ko được kể với ai...\nTôi có 1 cô bạn thân. Một cô gái hết sức bình thường, ko xinh đẹp, cũng chẳng duyên dáng nhưng cô ấy luôn là tâm điểm chú ý và được mọi người quan tâm chiều chuộng mỗi khi xuất hiện. Ngoài ra cô còn vô cùng tự tin, chẳng thế mà cô khiến bao chàng trai phải chết mê chết mệt.\nHẳn cô ấy có bí quyết. Chẳng ai biết đó là gì. Rồi một ngày tôi đề nghị tiết lộ.\nCô ấy nói rằng chính mùi hương là thứ vũ khí bí mật mà cô có, tôi thuyết phục cô ấy chia sẻ và phải rất vất vả tôi mới có được cái tên. Cô ấy nói tiếp:\n\"Ko giống những chai nước hoa được đóng sẵn ngoài kia. Những mùi hương này ko sản xuất đại trà, chúng được điều chế bằng tay theo sở thích của khách hàng và dành riêng cho họ mà thôi. Chỉ khi khách đặt hàng, nước hoa mới đc pha, như vậy sẽ giữ được chất lượng và sự tinh nguyên của mùi vị. Thứ nước hoa tinh khiết, trong trẻo và toả ngát hương thơm...\"\nTôi vô cùng hoài nghi và quyết định thử. Và sau đó...\nTôi như lặng đi ngay khi những màn sương nước hoa đầu tiên phảng phất trên tay.\nThứ mùi hương này thực sự kì lạ, từ những note hương đầu nhẹ nhàng đến tầng hương cuối dữ dội.\nSự hòa quyện hoàn hảo này trở nên lấp lánh cùng và cũng thật ma mị, cuốn xoáy cảm xúc của bất cứ kẻ nào bước đến gần.\nĐể mà nói, các cô gái xịt những mùi hương này mang một ma lực cực mạnh. Ko một ng đàn ông nào có thể cưỡng lại dc sự quyến rũ đó. Nói đơn giản là \"Em ơi ko cần cưa đâu để anh tự đổ !!!!\"\n---------------------------------\nNhận được cơn mưa lời khen trong suốt thời gian qua, hiện hãng đang bán với mức giá ưu đãi đáng kinh ngạc. Nhìn mà xem, bạn ko cần phải mất đến hàng ngàn đô để tận hưởng nước hoa thủ công cao cấp.\nHãy nhanh tay trải nghiệm, rất có thể nó sẽ khiến bạn và mọi người xung quanh phát cuồng!\nBạn có thể tìm hiểu và đặt hàng tại https://jolie-parfum.com\nCứ thử, và bạn sẽ thấy..."
  },
  {
    "id": "ad_3_advertorial",
    "title": "Bài 3 - Dạng Advertorial",
    "type": "Advertorial",
    "image": "https://placehold.co/600x400/808080/FFFFFF?text=Image+2",
    "content": "Đừng có tin nếu ai đó nói bà bầu không được dùng mỹ phẩm!\nMang bầu tháng đến tháng 5, chị cảm giác như mình đã không thể chịu nỗi nữa. Không make up, không kẻ mắt, thâm chí đến chút son môi cũng không dám dùng. Tất cả chỉ vì lo ảnh hưởng đến con.\nTrước đây, vốn là người coi trọng hình thức, chị luôn có quan điểm mỗi khi ra ngoài mình phải thật xinh đẹp. Nếu không xinh, chị sẽ không tự tin. Vậy nên thời con gái chị học trang điểm từ rất sớm. Ấy vậy mà từ khi biết mình mang thai, mọi thứ đều phải dừng lại hết. Xuất phát từ ý thức của bản thân, từ chồng, rồi mẹ chồng, đều thấy rằng việc dùng mỹ phẩm chứa #hóa_chất_độc_hại sẽ gây ảnh hưởng đến thai nhi. Vậy là từ đó, chị luôn ra ngoài với khuôn mặt mộc. Mấy tháng đầu còn đỡ, giờ càng ngày khuôn mặt càng #tái_nhợt, #xanh_xao, đôi môi luôn khô khốc nứt nẻ. Nhìn mình trong gương mà chán.\nCứ thế này mãi không thể được. Chị phải nghĩ cách. Tìm hiểu thông tin thì thấy nguyên nhân chính khiến bầu không nên dùng mỹ phẩm đó là nguy_cơ của các thành phần trong đó. Ví dụ trong son, phấn hay có chì, trong sản phẩm chăm sóc da hay có chất bảo quản.\nNhư vậy, chỉ cần tìm được một sản phẩm an toàn, không chứa các chất trên là được phải không!\nTiếp đó, chị hướng đến những sản phẩm có nguồn gốc từ thiên nhiên. Trong quá trình tìm hiểu, tình cờ chị biết đến son không chì của Cỏ mềm được khá nhiều người yêu thích. Đọc bảng thành phần thấy nguồn gốc 100% từ thiên nhiên nên lại càng yên tâm, chị mua 1 thỏi dùng thử. Không dày như son lỳ, không bóng như son kem, đánh lên môi có cảm giác: mỏng, mềm, mịn, rất tự nhiên. Vậy nên, chị hoàn toàn không có cảm giác là mình đang đánh son.\nGiờ đây, mỗi khi đi chơi hay đi làm, chị đều thoa chút son môi cho hồng hào, rạng rỡ. Không chỉ vậy, chị còn dùng thêm các sản phẩm thiên nhiên khác của Cỏ mềm về chăm sóc da, xà bông thiên nhiên, đều rất thích ấy. Ai nói bà bầu không được dùng mỹ phẩm chứ?!"
  }
]
